Repository: stillru/evetools
Catalog: source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Welcome to EveCli's documentation!
ru: Документация по EveCli

source: Project to study Python and best practices ^-)
ru: Проект по изучению языка програмирования Python и луших практик :-)

source: Internal function. Returns a response from ESI API with an inventory_type value.
ru: Функция. Возвращает id товара.

source: Parameters
ru: Параметры

source: Region name.
ru: Название региона

source: Returns
ru: Возвращает

source: Data with goods type id.
ru: Данные с id товара

source: *list* -- List of trading goods.
ru: *list* -- Список товаров.

source: Orgers pickup from ESI API All orders are placed to SQL DB for later usage.
ru: Заказы из заданных регионов, заданных товаров сохраняются в БД для дальнейшего использования.

source: Internal function. Returns a response from ESI API with an region value.
ru: Функция. Возвращает id региона.

source: Data with region id.
ru: id региона

source: *list* -- List of regions.
ru: *list* -- Список регионов.

source: The function of searching inventory_type for each item of the goods list. The internal function ``g_id(name)`` is called, which returns a response from ESI API with an inventory_type value. Writes this value to sqlite. If there is such a record in the database - ignore.
ru: Функция поиска inventory_type в ESI API. Вызывается внутренняя функция g_id(name) которая возвращает id. Полученные данные сохраняются в БД. Если запись существует - результат игнорируется.

source: Goods name.
ru: Название товара

source: The function of searching region for each item of the regions list. The internal function ``r_id(name)`` is called, which returns a response from ESI API with an region value. Writes this value to sqlite. If there is such a record in the database - ignore.
ru: Функция поиска id региона в ESI API. Вызывается внутренняя функция r_id(name) которая возвращает id. Полученные данные сохраняются в БД. Если запись существует - результат игнорируется.

source: Indices and tables
ru: Индексы и таблицы
